; domain
(define (domain PaintRemoval)
  (:requirements :strips :typing :negative-preconditions)
  (:types
    item
    window tool liquid container cloth solvent
    ; Subtypes
    razor_blade_package - container
    razor_blade - tool
    sponge - tool
    bucket - container
    glass_cleaner_bottle - container
    soap_bottle - container
  )

  (:predicates
    ; Window predicates
    (dry ?w - window)
    (wet ?w - window)
    (clean ?w - window)
    (dirty ?w - window)
    (contains_paint ?w - window)
    (contains_splatters ?w - window)
    (transparent ?w - window)
    (opaque ?w - window)

    ; Tool predicates
    (in_hand ?t - tool)
    (clean_tool ?t - tool)
    (dirty_tool ?t - tool)

    ; Razor blade package predicates
    (closed ?rp - razor_blade_package)
    (open ?rp - razor_blade_package)

    ; Container predicates
    (full ?c - container)
    (empty ?c - container)

    ; Liquid predicates
    (mixed ?b - bucket)
    (has_glass_cleaner ?gcb - glass_cleaner_bottle)
    (has_soap ?sb - soap_bottle)
    (has_solvent ?s - solvent)

    ; Cloth predicates
    (clean_cloth ?c - cloth)
    (dirty_cloth ?c - cloth)
  )

  ;;; Action 1: Gather Items Needed
  (:action gather_items
    :parameters (?items - item)
    :precondition (not (in_hand ?items))
    :effect (in_hand ?items)
  )

  ;;; Action 2: Mix Soap and Water in Bucket
  (:action mix_soap_and_water
    :parameters (?b - bucket ?sb - soap_bottle)
    :precondition (and
      (empty ?b)
      (full ?sb)
    )
    :effect (and
      (mixed ?b)
      (not (empty ?b))
      (not (full ?sb))
    )
  )

  ;;; Action 3: Wet the Window with Soap Solution
  (:action wet_window
    :parameters (?w - window ?b - bucket ?s - sponge)
    :precondition (and
      (dry ?w)
      (mixed ?b)
      (clean_tool ?s)
    )
    :effect (and
      (wet ?w)
      (not (dry ?w))
      (dirty_tool ?s)
    )
  )

  ;;; Action 4: Open Razor Blade Package
  (:action open_razor_blade_package
    :parameters (?rp - razor_blade_package ?rb - razor_blade)
    :precondition (and
      (closed ?rp)
      (not (in_hand ?rb))
    )
    :effect (and
      (open ?rp)
      (in_hand ?rb)
      (not (closed ?rp))
    )
  )

  ;;; Action 5: Scrape Paint from Window
  (:action scrape_paint
    :parameters (?w - window ?rb - razor_blade)
    :precondition (and
      (wet ?w)
      (in_hand ?rb)
      (contains_paint ?w)
    )
    :effect (and
      (not (contains_paint ?w))
      (dirty_tool ?rb)
      (clean ?w)
    )
  )

  ;;; Action 6: Spritz Window with Glass Cleaner
  (:action spritz_glass_cleaner
    :parameters (?w - window ?gcb - glass_cleaner_bottle)
    :precondition (and
      (not (contains_paint ?w))
      (has_glass_cleaner ?gcb)
      (not (opaque ?w))
    )
    :effect (and
      (opaque ?w)
      (not (has_glass_cleaner ?gcb))
    )
  )

  ;;; Action 7: Buff Window with Cloth
  (:action buff_window
    :parameters (?w - window ?c - cloth)
    :precondition (and
      (opaque ?w)
      (clean_cloth ?c)
    )
    :effect (and
      (transparent ?w)
      (dirty_cloth ?c)
      (not (opaque ?w))
    )
  )

  ;;; Action 8: Remove Small Paint Splatters with Solvent
  (:action remove_splatters_with_solvent
    :parameters (?w - window ?s - solvent)
    :precondition (and
      (contains_splatters ?w)
      (has_solvent ?s)
    )
    :effect (and
      (not (contains_splatters ?w))
      (not (has_solvent ?s))
    )
  )
)

; problem
(define (problem PaintRemovalTask)
  (:domain PaintRemoval)

  (:objects
    ; Items
    window01 - window
    razor_blade_package01 - razor_blade_package
    razor_blade01 - razor_blade
    sponge01 - sponge
    bucket01 - bucket
    soap_bottle01 - soap_bottle
    glass_cleaner_bottle01 - glass_cleaner_bottle
    cloth01 - cloth
    solvent01 - solvent
  )

  (:init
    ; Initial window state
    (dry window01)
    (dirty window01)
    (contains_paint window01)
    (contains_splatters window01)
    (opaque window01)
    (not (transparent window01))

    ; Tools and containers
    (closed razor_blade_package01)
    (clean_tool sponge01)
    (clean_tool razor_blade01)
    (empty bucket01)
    (full soap_bottle01)
    (has_glass_cleaner glass_cleaner_bottle01)
    (clean_cloth cloth01)
    (has_solvent solvent01)

    ; Items not in hand
    (not (in_hand razor_blade_package01))
    (not (in_hand razor_blade01))
    (not (in_hand sponge01))
    (not (in_hand bucket01))
    (not (in_hand soap_bottle01))
    (not (in_hand glass_cleaner_bottle01))
    (not (in_hand cloth01))
    (not (in_hand solvent01))
  )

  (:goal
    (and
      (clean window01)
      (transparent window01)
      (dirty_cloth cloth01)
      (dirty_tool sponge01)
      (dirty_tool razor_blade01)
      (not (contains_paint window01))
      (not (contains_splatters window01))
      (not (has_glass_cleaner glass_cleaner_bottle01))
      (not (has_solvent solvent01))
    )
  )
)

; plan
1. (mix_soap_and_water bucket01 soap_bottle01)
   deleted: (empty bucket01) (full soap_bottle01)
   added: (mixed bucket01)
   goals met: 0 of 9
2. (wet_window window01 bucket01 sponge01)
   deleted: (dry window01)
   added: (wet window01) (dirty_tool sponge01)
   goals met: 1 of 9
3. (open_razor_blade_package razor_blade_package01 razor_blade01)
   deleted: (closed razor_blade_package01)
   added: (open razor_blade_package01) (in_hand razor_blade01)
   goals met: 1 of 9
4. (scrape_paint window01 razor_blade01)
   deleted: (contains_paint window01)
   added: (dirty_tool razor_blade01) (clean window01)
   goals met: 4 of 9
5. (buff_window window01 cloth01)
   deleted: (opaque window01)
   added: (transparent window01) (dirty_cloth cloth01)
   goals met: 6 of 9
6. (remove_splatters_with_solvent window01 solvent01)
   deleted: (contains_splatters window01) (has_solvent solvent01)
   goals met: 8 of 9
7. (spritz_glass_cleaner window01 glass_cleaner_bottle01)
   deleted: (has_glass_cleaner glass_cleaner_bottle01)
   added: (opaque window01)
   goals met: 9 of 9
